# StairsActualRunWidthLessThanMinimumFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsActualRunWidthLessThanMinimumFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Actual run width is less than minimum run width defined in stairs type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsActualRunWidthLessThanMinimumFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsActualRunWidthLessThanMinimumFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsActualRunWidthLessThanMinimumFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace